app/Models/ModelInfoToko.php

SELECT *
FROM `tbl_infotoko`
JOIN `tbl_toko` ON `tbl_toko`.`id_merek` = `tbl_infotoko`.`id_merek`
JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_infotoko`.`id_provinsi`
JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_infotoko`.`id_kabupaten`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_infotoko`.`id_kecamatan`
---
    public function AllData(){
        return $this->db->table('tbl_infotoko')
        ->join('tbl_toko', 'tbl_toko.id_merek = tbl_infotoko.id_merek')
        ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_infotoko.id_provinsi')
        ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_infotoko.id_kabupaten')
        ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_infotoko.id_kecamatan')
        ->get()->getResultArray();