app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `tbl_wilayah`
---
    public function JmlWilayah()
    {
        return $this->db->table('tbl_wilayah')
            ->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_infotoko`
---
    public function JmlInfoToko()
    {
        return $this->db->table('tbl_infotoko')
            ->countAll();