app/Models/ModelUser.php

    public function AllData()
{
    return $this->db->table('users')
        ->select('users.*, auth_groups.name as group_name')
        ->join('auth_groups_users', 'auth_groups_users.user_id = users.id', 'left')
        ->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id', 'left')
        ->get()->getResultArray();
---
SELECT `users`.*, `auth_groups`.`name` as `group_name`
FROM `users`
LEFT JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
LEFT JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`

    public function DetailData($id)
    {
        return $this->db->table($this->table)
            ->select('users.*, auth_groups.name as group_name')
            ->join('auth_groups_users', 'auth_groups_users.user_id = users.id', 'left')
            ->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id', 'left')
            ->where('users.id', $id)
            ->get()->getRowArray();
---
SELECT `users`.*, `auth_groups`.`name` as `group_name`
FROM `users`
LEFT JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
LEFT JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
WHERE `users`.`id` = '51'

    public function DeleteData($data)
    {
        $this->db->table($this->table)
            ->where('id', $data['id'])
            ->delete($data);
---
DELETE FROM `users`
WHERE `id` = '51'
AND `id` = '51'