app/Models/ModelToko.php

    public function AllData(){
        return $this->db->table('tbl_toko')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_toko`