app/Views/v_dashboard.php


                $db = \Config\Database::connect();
                foreach ($toko as $key => $value) {
                    $jml = $db->table('tbl_infotoko')->where('id_merek', $value['id_merek'])->countAllResults();
                    // Ambil logo dari tabel tbl_toko berdasarkan id_merek
                    $logo = $db->table('tbl_toko')->select('logo')->where('id_merek', $value['id_merek'])->get()->getRow();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_infotoko`
WHERE `id_merek` = '1'
SELECT `logo`
FROM `tbl_toko`
WHERE `id_merek` = '1'

            <div class="row row-cols-1 row-cols-md-2 row-cols-lg-4">
                <?php
                // Query untuk mengambil data kecamatan dari tbl_infotoko
                $query = $db->table('tbl_infotoko')
                    ->select('tbl_kecamatan.id_kecamatan, tbl_kecamatan.nama_kecamatan, COUNT(tbl_infotoko.id_merek) as jumlah')
                    ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_infotoko.id_kecamatan')
                    ->groupBy('tbl_infotoko.id_kecamatan')
                    ->get();

                foreach ($query->getResult() as $row) :
                    // Query untuk mengambil data merek dan jumlahnya dalam kecamatan tertentu
                    $merekQuery = $db->table('tbl_infotoko')
                        ->select('tbl_toko.merek, COUNT(tbl_infotoko.id_merek) as jumlah_merek, tbl_toko.logo')
                        ->join('tbl_toko', 'tbl_toko.id_merek = tbl_infotoko.id_merek')
                        ->where('tbl_infotoko.id_kecamatan', $row->id_kecamatan)
                        ->groupBy('tbl_infotoko.id_merek')
                        ->get();
---
SELECT `tbl_kecamatan`.`id_kecamatan`, `tbl_kecamatan`.`nama_kecamatan`, COUNT(tbl_infotoko.id_merek) as jumlah
FROM `tbl_infotoko`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_infotoko`.`id_kecamatan`
GROUP BY `tbl_infotoko`.`id_kecamatan`
SELECT `tbl_toko`.`merek`, COUNT(tbl_infotoko.id_merek) as jumlah_merek, `tbl_toko`.`logo`
FROM `tbl_infotoko`
JOIN `tbl_toko` ON `tbl_toko`.`id_merek` = `tbl_infotoko`.`id_merek`
WHERE `tbl_infotoko`.`id_kecamatan` = '3205010'
GROUP BY `tbl_infotoko`.`id_merek`